Revit 2027 API
ParameterTypeId.SteelElemWeldMainRootopening Property
 "Main Root Opening"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldMainRootopening { get; }
Public Shared ReadOnly Property SteelElemWeldMainRootopening As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldMainRootopening {
	ForgeTypeId^ get ();
}
static member SteelElemWeldMainRootopening : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace